clc; clear;

c1 = 743;
tau1 = 0.2;
T = 1;
M = 1500;
Ca = 1.19;
v = 25;
g=9.8;


n1 = c1/(M*T*tau1);
n4 = c1/(T*tau1);

d1 = [1 1/T];
d2 = [1 1/tau1];
d3_2 = [1 (Ca*v)/M];
d12 = conv(d1,d2);
d_2 = conv(d12,d3_2);
sys = tf(n1,d_2);

%модель сигнала
dr = [1 1];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%ПУНК 1
[B1,A1]= tfdata(sys, 'v');

b = B1;
a = A1;

% % % main% % % c = [1 11.556 60 68 20.8018];
c = [1 9.4 27.1 42.6 25.2 6];
% c = [1 11.556 60 68 20.8018];
%a = conv(a,[1 1])
c(1);
[l1,p1] = paq(a,b,c)
c_dl1 = l1'
c_np1 = p1'      

C_n1 = c_np1;
C_d1 = c_dl1;
%C_d1 = conv(c_dl1,dr)
C_g = tf(C_n1, C_d1)
%%%%%%%%%%%%%%%%%%%%%%%%%%
%Пункт второй

% c2 = [1 11 27.1 40.1 26.2 6]
% % c2 = [1 32.5 46.5 12.5 45.5 1]
% a1 = conv(a,[1 0])
% c(1);
% [l2,p2] = paq(a1,b,c2)
% c_dl2 = l2'
% c_np2 = p2'
% 
% C_n2 = c_np2;
% C_d2 = c_dl2;
% %C_d2 = conv(c_dl2,[1 0])
% C_g2 = tf(C_n2, C_d2)
%%%%%%%%%%%%%%%%%%%%%%%%%%%

c3 = [1 10 31.1 45.1 29.5 7]
% c2 = [1 32.5 46.5 12.5 45.5 1]
% a1 = conv(a,[1 0])
c3(1);
[l3,p3] = paq(a,b,c3)
c_dl3 = l3'
c_np3 = p3'

c_dl_3 = conv(c_dl3, [1 0])
c_np_3 = conv(c_np3, [1 0])
C_n3 = c_np_3
C_d3 = c_dl_3
C_g3 = tf(C_n3, C_d3)
% C_n3 = [54.0457 55.4786 0]% 10.4968]
% C_d_3 = [60 78.24];
% C_d3 = conv(C_d_3,[1 0])
% C_g3 = tf(C_n3, C_d3)

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%упреждение
kr = 0.00026918;
C_g4 = tf(n4,d12)
%%%%%%%%%%%%%%%%%%%%%%%
% a6 = d12;
% b6 = n4;
% 
% % c6 = [1 3 12 2];
% c6 = [1 21 111 331 240]
% [l6,p6] = paq(a6,b6,c6)
% c_dl6 = l6'
% c_np6 = p6'
% C_n6 = c_np6;
% C_d6 = c_dl6;
%%%%%%%%%%%%%%%%%%%%%%%%
[ci6,nci6,dci6]=awup(c_np1,c_dl1)

C_g_7 = tf(C_d1, C_n1);
C_g7 = C_g_7-(1/ci6)
[c7_num,c7_dem] = tfdata(C_g7, 'v')
